### Import the libraries

In [1]:
import pandas as pd
import numpy as np
import datetime

### Load the dataset

In [2]:
date = pd.read_csv(r'data/orders.csv')
time = pd.read_csv(r'data/messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.drop(columns=['product_id', 'city_id', 'orders'], axis=1, inplace=True)
time.drop(columns=['msg'], axis=1, inplace=True)

### Working with Dates

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

#### Converting date column to datetime

In [7]:
date['date'] = pd.to_datetime(date['date'])

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

#### Extracting year

In [9]:
date['year'] = date['date'].dt.year

In [10]:
date.head()

        date  year
0 2019-12-10  2019
1 2018-08-15  2018
2 2018-10-23  2018
3 2019-08-17  2019
4 2019-01-06  2019

#### Extracting month and month name

In [11]:
date['month'] = date['date'].dt.month
date['month_name'] = date['date'].dt.month_name()

In [12]:
date.head()

        date  year  month month_name
0 2019-12-10  2019     12   December
1 2018-08-15  2018      8     August
2 2018-10-23  2018     10    October
3 2019-08-17  2019      8     August
4 2019-01-06  2019      1    January

#### Extracting days

In [13]:
date['day'] = date['date'].dt.day

In [14]:
date.head()

        date  year  month month_name  day
0 2019-12-10  2019     12   December   10
1 2018-08-15  2018      8     August   15
2 2018-10-23  2018     10    October   23
3 2019-08-17  2019      8     August   17
4 2019-01-06  2019      1    January    6

#### Extracting day of week

In [15]:
date['day_of_week'] = date['date'].dt.dayofweek

In [16]:
date.head()

        date  year  month month_name  day  day_of_week
0 2019-12-10  2019     12   December   10            1
1 2018-08-15  2018      8     August   15            2
2 2018-10-23  2018     10    October   23            1
3 2019-08-17  2019      8     August   17            5
4 2019-01-06  2019      1    January    6            6

#### Extracting day of the week name

In [17]:
date['day_of_week_name'] = date['date'].dt.day_name()

In [18]:
date.head()

        date  year  month month_name  day  day_of_week day_of_week_name
0 2019-12-10  2019     12   December   10            1          Tuesday
1 2018-08-15  2018      8     August   15            2        Wednesday
2 2018-10-23  2018     10    October   23            1          Tuesday
3 2019-08-17  2019      8     August   17            5         Saturday
4 2019-01-06  2019      1    January    6            6           Sunday

#### Is the day_of_week weekend?

In [19]:
date['day_weekened'] = np.where(date['day_of_week_name'].isin(['Saturday', 'Sunday']), 1, 0)

In [20]:
date.head()

,date,year,month,month_name,day,day_of_week,day_of_week_name,day_weekened
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

#### Extracting week of the year

In [21]:
date['week'] = date['date'].dt.isocalendar().week

In [22]:
date.head()

,date,year,month,month_name,day,day_of_week,day_of_week_name,day_weekened,week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

#### Extracting Quarter

In [23]:
date['quarter'] = date['date'].dt.quarter

In [24]:
date.head()

,date,year,month,month_name,day,day_of_week,day_of_week_name,day_weekened,week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

#### Extracting Semester

In [25]:
date['semester'] = np.where(date['quarter'].isin([1, 2]), 1, 2)

In [26]:
date.head()

,date,year,month,month_name,day,day_of_week,day_of_week_name,day_weekened,week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

#### Extracting time elapsed between dates

In [27]:
today = datetime.datetime.today()
today

datetime.datetime(2025, 6, 22, 14, 7, 13, 602309)

In [28]:
today - date['date']

0     2021 days 14:07:13.602309
1     2503 days 14:07:13.602309
2     2434 days 14:07:13.602309
3     2136 days 14:07:13.602309
4     2359 days 14:07:13.602309
                 ...
995   2449 days 14:07:13.602309
996   2390 days 14:07:13.602309
997   2238 days 14:07:13.602309
998   2303 days 14:07:13.602309
999   2077 days 14:07:13.602309
Name: date, Length: 1000, dtype: timedelta64[ns]

#### Extracting days passes b/w dates

In [29]:
(today - date['date']).dt.days

0      2021
1      2503
2      2434
3      2136
4      2359
       ...
995    2449
996    2390
997    2238
998    2303
999    2077
Name: date, Length: 1000, dtype: int64

#### Extracting weeks passes b/w dates

In [30]:
# Months passed not working - np.round((today -date['date']) / np.timedelta64(1, 'M'),0)
np.round((today - date['date']) / np.timedelta64(1, 'W'), 0)

0      289.0
1      358.0
2      348.0
3      305.0
4      337.0
       ...
995    350.0
996    342.0
997    320.0
998    329.0
999    297.0
Name: date, Length: 1000, dtype: float64

### Working with Time

#### Converting date to datetime

In [31]:
time['date'] = pd.to_datetime(time['date'])

In [32]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

#### Extracting hours, mins and sec

In [33]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [34]:
time.head()

                 date  hour  min  sec
0 2013-12-15 00:50:00     0   50    0
1 2014-04-29 23:40:00    23   40    0
2 2012-12-30 00:21:00     0   21    0
3 2014-11-28 00:31:00     0   31    0
4 2013-10-26 23:11:00    23   11    0

#### Extracting time part

In [35]:
time['time'] = time['date'].dt.time

In [36]:
time.head()

                 date  hour  min  sec      time
0 2013-12-15 00:50:00     0   50    0  00:50:00
1 2014-04-29 23:40:00    23   40    0  23:40:00
2 2012-12-30 00:21:00     0   21    0  00:21:00
3 2014-11-28 00:31:00     0   31    0  00:31:00
4 2013-10-26 23:11:00    23   11    0  23:11:00

#### Finding time difference

In [37]:
today - time['date']

0     4207 days 13:17:13.602309
1     4071 days 14:27:13.602309
2     4557 days 13:46:13.602309
3     3859 days 13:36:13.602309
4     4256 days 14:56:13.602309
                 ...
995   4846 days 13:17:13.602309
996   4167 days 14:53:13.602309
997   4632 days 14:30:13.602309
998   4748 days 14:33:13.602309
999   4020 days 14:42:13.602309
Name: date, Length: 1000, dtype: timedelta64[ns]

#### Time Difference - Seconds, Minutes and Hours

In [38]:
(today - time['date'])/np.timedelta64(1, 's')

0      3.635326e+08
1      3.517864e+08
2      3.937744e+08
3      3.334666e+08
4      3.677722e+08
           ...
995    4.187422e+08
996    3.600824e+08
997    4.002570e+08
998    4.102796e+08
999    3.473809e+08
Name: date, Length: 1000, dtype: float64

In [39]:
(today - time['date'])/np.timedelta64(1, 'm')

0      6.058877e+06
1      5.863107e+06
2      6.562906e+06
3      5.557776e+06
4      6.129536e+06
           ...
995    6.979037e+06
996    6.001373e+06
997    6.670950e+06
998    6.837993e+06
999    5.789682e+06
Name: date, Length: 1000, dtype: float64

In [40]:
(today - time['date'])/np.timedelta64(1, 'h')

0      100981.287112
1       97718.453778
2      109381.770445
3       92629.603778
4      102158.937112
           ...
995    116317.287112
996    100022.887112
997    111182.503778
998    113966.553778
999     96494.703778
Name: date, Length: 1000, dtype: float64